{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 165, 120], "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_5"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_6"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_10"}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 5}}]}